x = 2
y = 8

print(x + y)  # додавання
print(x + 3)
print(x - y)  # віднімання
print(x * y)  # множення
print(x / y)  # поділ
print(x // y)  # цілочисленний поділ
print(x % y)  # залишок від ділення
print(x ** y)  # зведення в ступінь
print(3.2 * 0.8 - 2 * 5 - 3 ** 3)  # арифметичний вираз
print(4 ** 0.5)  # зведення у ступінь 0.5 – квадратний корінь

z = -2
print(abs(z))  # модуль числа
print(pow(z, 2), z ** 2)  # квадрат числа

m = 3.26
print(round(m), round(m, 1))  # округлення числа до цілого та до одного знака після коми
