name = None  # спочатку ми не знаємо імені користувача

# безкінечний цикл
while True:
    print('Меню:')
    print("1. Ввести ім'я")
    print('2. Вивести вітання')
    print('3. Вийти')

    response = input('Виберіть пункт: ')
    print()

    if response == '1':
        name = input("Введіть ваше ім'я:" )
    elif response == '2':
        if name:  # вітаємося з користувачем, якщо ім'я вже введене
            print('Вітаю, ', name, '!', sep='')
        else:
            print('Я не знаю вашого імені.')
    elif response == '3':
        # оператор break завершує виконання циклу
        break  # якщо користувач вибрав третій пункт, то виходимо із циклу
    else:
        print('Такого пункту не існує.')

    print()
