# Завдання 1 (Lesson: 2)
# Напишіть програму, використовуючи знання про змінні типу цілих чисел, щоб порахувати за
# який час транспортний засіб доїде з пункту А до пункту В, якщо відомі наступні дані:
# відстань від А до В = 250 км, швидкість автомобіля буде постійною та дорівнює 80 км/год.
# Використовуйте формулу: Час = відстань / швидкість.
# Створіть змінні length, куди запишіть відстань,
# velocity, куди запишіть швидкість
# та змінну time, куди запишіть результат.
# Після цього використовуйте метод print(), щоб вивести в консоль результат.
length = input("Enter length [km]: ") or 250
velocity = input("Enter velocity ['km/h]: ") or 80
time = length / velocity
print(f"Time=[{time}]=length[{length}]/velocity[{velocity}]")

print(40*"--")
# Завдання 2
# Створіть змінну age = 25, змінну name = "John".
# Виведіть у консоль ― "My name is <name> and I am <age>", але зробіть рішення таким, щоб
# використовувалася конкатенація рядків (через +) та приведення типу числа до рядка (str(...)).
# Тобто, якщо замінити змінні age і name, то в методі print() нічого не потрібно було б змінювати.
# Наприклад, a = 10, print("Value = " + str(a)) і буде ― "Value = 10"
name = input("Enter your name: ").capitalize()
age = int(input(f"Enter your age, \"{name}\": "))
print("My name is " + name + " and I am " + str(age))

print(40*"--")