from colorama import Fore, Style

A = {3, 5, 11, 7, 4, -3}
B = {11, 5, 8, 1, 10, 7}
print(f"A = {A}")
print(f"B = {B}")

print('Завдання 1 \n '
      f'{Fore.GREEN}Вивести в консоль елементи A, яких немає в B{Style.RESET_ALL}!')

print(A.difference(B))
print(A - B)

# ----------------------------------------------------------------------------------------------------------------------
print('Завдання 2 \n '
      f'{Fore.GREEN}Вивести в консоль спільні елементи А та В{Style.RESET_ALL}!')

print(A.intersection(B))
print(A & B)
# ----------------------------------------------------------------------------------------------------------------------
print('Завдання 3 \n '
      f"{Fore.GREEN}Вивести в консоль об'єднання множин А та В{Style.RESET_ALL}!")

print(A.union(B))
print(A | B)
# ----------------------------------------------------------------------------------------------------------------------
print('Завдання 4 \n '
      f'{Fore.GREEN}Є рядок a = "a14b6fh"; як дізнатися, що всі символи унікальні, використовуючи множини та списки?{Style.RESET_ALL}!')

a4 = "a14b6fh"
print(len(set(a4)) == len(a4))

print(40 * "--")  # ----------------------------------------------------------------------------------------------------

print("Завдання 1 \n " +
      Fore.GREEN + "Є словник: d = {'a':3, 'b':0, 'c':4, 'd':-3}. Знайти найбільше число серед значень словника " + Style.RESET_ALL + "!")

d1 = {'a': 3, 'b': 0, 'c': 4, 'd': -3}
print(max(d1.values()))
print(sorted(d1.items(), key=lambda x: x[1]).pop())
# ----------------------------------------------------------------------------------------------------------------------
print('Завдання 2 \n ' +
      Fore.GREEN + "Аналогічно до завдання 1, тільки словник d = {'a':3, 'b': 'hello', 'c':4, 'd':-3}" + Style.RESET_ALL + "!")

d2 = {'a': 3, 'b': 'hello', 'c': 4, 'd': -3}
d = []
for i in d2.values():
    d.append(str(i))
print(max(d))

print(40 * "--")  # ----------------------------------------------------------------------------------------------------

print('Завдання 1 \n '
      f'{Fore.GREEN}Є список а = [2, 4, 65, 32, 2, 6, 0, -1, 3]. Вивести всі значення менше 5 у консоль.{Style.RESET_ALL}!')

a = [2, 4, 65, 32, 2, 6, 0, -1, 3]
new_a = []
for i in a:
    if i < 5:
        new_a.append(i)
print(new_a)
# ----------------------------------------------------------------------------------------------------------------------
print('Завдання 2 \n '
      f'{Fore.GREEN}"aabbаа" - паліндром. Як це перевірити?{Style.RESET_ALL}!')
s = "aabbaa"
print(s == s[::-1])
# ----------------------------------------------------------------------------------------------------------------------
print('Завдання 3 \n '
      f'{Fore.GREEN}Є список a = [1, 3, 9, 13, 7, 8, 13, 32, 44, 59, 19]{Style.RESET_ALL}!'
      f'{Fore.GREEN}Виведіть всі елементи, які менше 6{Style.RESET_ALL}!')

a = [1, 3, 9, 13, 7, 8, 13, 32, 44, 59, 19]
new_a = []
for i in a:
    if i < 5:
        new_a.append(i)
print(new_a)
# ----------------------------------------------------------------------------------------------------------------------
print('Завдання 4 \n '
      f"{Fore.GREEN}На основі списку a = ['red', 'yellow', 'blue', 'bread']{Style.RESET_ALL}!"
      f'{Fore.GREEN}Створити список, у якому буде лише слово, зайве у списку a{Style.RESET_ALL}!')

a = ['red', 'yellow', 'blue', 'bread']
new_a = []
for i in a:
    if i != 'red' and i != 'yellow' and i != 'blue':
        new_a.append(i)
print(new_a)
