"""
На вхід дається будь-яке число. Дізнатися скільки розрядів у числі - воно (1, 2, 3 або більш значне), позитивне чи
негативне? Наприклад, 25 - це двозначне позитивне, а -345 це тризначне негативне, а 2400 - це 3х і більш
значне позитивне. 0 враховувати як окремий варіант, а не як однозначне число.
"""

number = int(input("введіть ціле число: "))

sign = "позитивне" if number > 0 else "негативне"

if number == 0:
    print("варіант - 0")
elif len(str(abs(number))) == 1:
    print(f"один знак і {sign}")
elif len(str(abs(number))) == 2:
    print(f"двозначне і {sign}")
elif len(str(abs(number))) == 3:
    print(f"три знаки і {sign}")
else:
    print(f"багатозначне і {sign}")